colo_emojis = {
    # 美国（United States）
    "SJC": ["🇺🇸", "US"],  # 圣何塞
    "LAX": ["🇺🇸", "US"],  # 洛杉矶
    "SEA": ["🇺🇸", "US"],  # 西雅图
    "JFK": ["🇺🇸", "US"],  # 纽约 - 肯尼迪国际机场
    "ORD": ["🇺🇸", "US"],  # 芝加哥 - 奥黑尔国际机场
    "IAD": ["🇺🇸", "US"],  # 华盛顿杜勒斯国际机场
    "EWR": ["🇺🇸", "US"],  # 纽瓦克自由国际机场
    "CMH": ["🇺🇸", "US"],  # 哥伦布国际机场
    "PDX": ["🇺🇸", "US"],  # 俄勒冈州 - 波特兰国际机场

    # 加拿大（Canada）
    "YUL": ["🇨🇦", "CA"],  # 蒙特利尔
    "YYZ": ["🇨🇦", "CA"],  # 多伦多
    "YVR": ["🇨🇦", "CA"],  # 温哥华

    # 德国（Germany）
    "FRA": ["🇩🇪", "DE"],  # 法兰克福

    # 法国（France）
    "CDG": ["🇫🇷", "FR"],  # 巴黎戴高乐机场

    # 英国（United Kingdom）
    "LHR": ["🇬🇧", "GB"],  # 伦敦

    # 荷兰（Netherlands）
    "AMS": ["🇳🇱", "NL"],  # 阿姆斯特丹

    # 日本（Japan）
    "NRT": ["🇯🇵", "JP"],  # 东京成田
    "HND": ["🇯🇵", "JP"],  # 东京羽田
    "KIX": ["🇯🇵", "JP"],  # 大阪

    # 香港（中国特别行政区）
    "HKG": ["🇭🇰", "HK"],  # 香港国际机场

    # 韩国（South Korea）
    "ICN": ["🇰🇷", "KR"],  # 仁川

    # 台湾（中国省份）
    "TPE": ["🇹🇼", "TW"],  # 台北桃园
    "KHH": ["🇹🇼", "TW"],  # 高雄

    # 新加坡（Singapore）
    "SIN": ["🇸🇬", "SG"],  # 樟宜机场

    # 印度（India）
    "BOM": ["🇮🇳", "IN"],  # 孟买

    # 瑞典（Sweden）
    "ARN": ["🇸🇪", "SE"],  # 斯德哥尔摩

    # 芬兰（Finland）
    "HEL": ["🇫🇮", "FI"],  # 赫尔辛基

    # 巴西（Brazil）
    "GRU": ["🇧🇷", "BR"],  # 圣保罗

    # 波兰（Poland）
    "WAW": ["🇵🇱", "PL"],  # 华沙

    # 澳大利亚（Australia）
    "SYD": ["🇦🇺", "AU"],  # 悉尼
}
